Enums/ТипыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>COMОбъектWordApplication</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COMОбъектWordToPDF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПечати/Forms/ПечатьДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипФайла = СтрЗаменить(Параметры.ТипФайла, ".", "");
	ТипФайла = СтрЗаменить(ТипФайла, " ", "");
	Выполнить("УстановитьОтборДля_" + ТипФайла + "()");
	
	КоличествоКопий = 1;
	
	АдресХранилища = Параметры.АдресХранилища;
	
КонецПроцедуры

Процедура УстановитьОтборДля_docx()

	Элементы.СпособПечати.СписокВыбора.Добавить(Перечисления.ТипыПечати.COMОбъектWordApplication, "Печать средствами Word");
	Элементы.СпособПечати.СписокВыбора.Добавить(Перечисления.ТипыПечати.COMОбъектWordToPDF, "Конвертировать Word в PDF");

КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлыИзХранилища()

	Возврат ПолучитьИзВременногоХранилища(АдресХранилища);

КонецФункции // ()


&НаКлиенте
Процедура Печать(Команда)
	
	Если СпособПечати = ПредопределенноеЗначение("Перечисление.ТипыПечати.ПустаяСсылка") Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберете способ печати!";
		Сообщение.Сообщить();
		
		Возврат;
	
	КонецЕсли;
	
	ФайлыДляПечати = ПолучитьФайлыИзХранилища();
	
	Если СпособПечати = ПредопределенноеЗначение("Перечисление.ТипыПечати.COMОбъектWordApplication") Тогда
	
		Для каждого ФайлДляПечати Из ФайлыДляПечати Цикл
		
			ПечатьDOCФайлов(ФайлДляПечати);
		
		КонецЦикла;
	
	КонецЕсли;
	
	Если СпособПечати = ПредопределенноеЗначение("Перечисление.ТипыПечати.COMОбъектWordToPDF") Тогда
	
		Для каждого ФайлДляКонвертирования Из ФайлыДляПечати Цикл
		
			КонвертироватьWordToPDF(ФайлДляКонвертирования.Значение);
		
		КонецЦикла;
	
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Выполнено!";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьDOCФайлов(ПутьКФайлу)

	Word = Новый COMОбъект("Word.Application");
	Файл = Новый Файл(ПутьКФайлу);
	
	Если Файл.ЭтоФайл() И Файл.Существует() Тогда

		Для НомерКопии = 1 По КоличествоКопий Цикл
		
			Попытка
			
				Документ = Word.Documents.Add(ПутьКФайлу);
				Word.PrintOut();
				Документ.Close();
			
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Печать не удалась!";
				Сообщение.Сообщить();
			КонецПопытки;
		
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьWordToPDF(ПутьКФайлу)

	Word = Новый COMОбъект("Word.Application");
	Файл = Новый Файл(ПутьКФайлу);
	
	Если Файл.ЭтоФайл() И Файл.Существует() Тогда

		ИмяФайла = Файл.ИмяБезРасширения;
		Каталог = Файл.Путь;
		Попытка
		
			Word.Documents.Open(ПутьКФайлу);
			Word.Documents(ПутьКФайлу).Activate();
			Word.ActiveDocument.SaveAs(Каталог + ИмяФайла + ШаблоныДокументовКлиент.ФорматPDFФайла(), 17);
			Word.ActiveDocument.Close();
		
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Печать не удалась!";
			Сообщение.Сообщить();
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры
